---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidType
source: html/c1c50fad-9320-831c-2675-4ab23f720837.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.FluidType Property

Fluid Type

## Syntax (C#)
```csharp
public ElementId FluidType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: fluidTypeId is not a fluid type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null